app/models/concerns/current_cart.rb

  def current_cart
    if user_signed_in?
      current_user.find_or_create_cart
    else
      # For guest users, find or create cart and store in session
      if session[:cart_id]
        cart = Cart.find_by(id: session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-03-18 17:16:22.872285"], ["updated_at", "2021-03-18 17:16:22.872285"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]