app/helpers/application_helper.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 21]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 20]]
---
  def current_cart_count
    if user_signed_in?
      current_user.cart_item_count
    else
      session[:cart_id] ? Cart.find_by(id: session[:cart_id])&.total_items || 0 : 0