app/controllers/carts_controller.rb

  def show
    @cart_items = @cart.cart_items.includes(:product)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 2]]

  def empty
    @cart.clear
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]

  def set_cart
    if user_signed_in?
      @cart = current_user.find_or_create_cart
    else
      # For guest users, store cart in session
      @cart = Cart.find_by(id: session[:cart_id]) || Cart.create
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["user_id", 3], ["created_at", "2025-07-23 01:13:58.584967"], ["updated_at", "2025-07-23 01:13:58.584967"]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_product
    @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]