app/controllers/carts_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 2]]
---
  def show
    # Load cart items with associated products to avoid N+1 queries
    # This provides all necessary data for displaying cart contents
    @cart_items = @cart.cart_items.includes(:product)