app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY created_at desc
---
  def index
    @products = Product.all.order("created_at desc")

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @products = Product.find(params[:id])

INSERT INTO "products" ("brand", "model", "description", "condition", "finish", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "finish" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["finish", "Red"], ["price", 15000.0], ["updated_at", "2021-03-24 10:59:27.610077"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)