app/models/cart.rb

  def total_price
    cart_items.sum { |item| item.quantity * item.product.price }
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def add_product(product, quantity = 1)
    current_item = cart_items.find_by(product: product)

    if current_item
      current_item.quantity += quantity.to_i
      current_item.save
    else
      cart_items.create(product: product, quantity: quantity)
---
UPDATE "carts" SET "cart_items_count" = COALESCE("cart_items_count", 0) + ? WHERE "carts"."id" = ?  [["cart_items_count", 1], ["id", 1]]
INSERT INTO "cart_items" ("cart_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["cart_id", 1], ["product_id", 6], ["created_at", "2025-07-23 01:13:58.617337"], ["updated_at", "2025-07-23 01:13:58.617337"]]

  def decrement_product(product, quantity = 1)
    current_item = cart_items.find_by(product: product)
    return false unless current_item

    if current_item.quantity <= quantity
      current_item.destroy
    else
      current_item.quantity -= quantity
      current_item.save
---
UPDATE "carts" SET "cart_items_count" = COALESCE("cart_items_count", 0) - ? WHERE "carts"."id" = ?  [["cart_items_count", 1], ["id", 1]]

  def clear
    cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]